# yosys synthesis script for post-synthesis simulation (make test_vec_alu_synth)

read_verilog vec_alu.v
read_verilog vec_alu_wrapper.v
hierarchy -top vec_alu_wrapper
synth
write_verilog vec_alu_wrapper_synth.v
