# yosys synthesis script for post-synthesis simulation (make test_synth)

read_verilog picorv32.v
read_verilog rvv.v
read_verilog rvv_alu_wrapper.v
read_verilog rvv_alu.v
chparam -set COMPRESSED_ISA 1 -set ENABLE_MUL 1 -set ENABLE_DIV 1 \
        -set ENABLE_IRQ 1 -set ENABLE_TRACE 1 -set ENABLE_RVV 1 -set LANE_WIDTH 3 -set NB_LANES 1 picorv32_axi
hierarchy -top picorv32_axi
synth
write_verilog synth.v
